AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastPriceType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИмпортДанныхБрокера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИмпортДанныхБрокера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expectedYield</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPricePt</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currentPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>quantityLots</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ticker</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>instrumentUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсточникиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Платформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключенКСтратегии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ms_РаботаСREST/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция TInvest_НайтиИнструмент(СтрокаПоиска, ТипИнструмента = "INSTRUMENT_TYPE_UNSPECIFIED", ТолькоТоргуемые = Истина, Песочница = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Тело запроса
	Тело = Новый Структура;
	Тело.Вставить("query", СтрокаПоиска);
	Тело.Вставить("instrumentKind", ТипИнструмента);
	Тело.Вставить("apiTradeAvailableFlag", ТолькоТоргуемые);

	ТелоJSON = TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	Данные = TInvest_ВыполнитьЗапрос("POST", "InstrumentsService", "FindInstrument", ПараметрыЗапроса, Ложь);

	Возврат Данные;

КонецФункции

Функция TInvest_ОсновнаяИнформацияОбИнструменте(СтрокаПоиска, КлассКод = "INSTRUMENT_TYPE_UNSPECIFIED", idType = "INSTRUMENT_ID_TYPE_TICKER", ТолькоТоргуемые = Истина, Песочница = Ложь) Экспорт

	// Тело запроса
	Тело = Новый Структура;
	Тело.Вставить("id_type", idType);
	Тело.Вставить("class_code", КлассКод);
	Тело.Вставить("id", СтрокаПоиска);

	ТелоJSON = TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	Данные = TInvest_ВыполнитьЗапрос("POST", "InstrumentsService", "GetInstrumentBy", ПараметрыЗапроса, Ложь);

	Возврат Данные;

КонецФункции

Процедура ПолучитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей) Экспорт

	Если ЗначениеЗаполнено(Инструменты) Тогда
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Инструменты.UID КАК UID,
			|	Инструменты.Ссылка КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
			|		ПО ПозицииИнструментовОстатки.Инструмент = Инструменты.Ссылка
			|ГДЕ
			|	Инструменты.UID <> """"";

		Инструменты = Запрос.Выполнить().Выгрузить();
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");

	КонецЕсли;

	Тело = Новый Структура;
	Тело.Вставить("instrumentId", МассивИдентификаторовИнструментов);
	ТелоJSON = ms_РаботаСREST.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ЦеныПоИнструментам = ms_РаботаСREST.TInvest_ВыполнитьЗапрос("POST", "MarketDataService", "GetLastPrices", ПараметрыЗапроса);

	Если Не ЦеныПоИнструментам.Свойство("lastPrices") Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;

	lastPrices = ЦеныПоИнструментам.lastPrices;
	Отбор = Новый Структура("UID");
	Источник = Справочники.ИсточникиДанных.ТИнвест;

	КоличествоЗаписей = 0;
	Для Каждого СтруктураИнструмента Из lastPrices Цикл

		МенеджерЗаписи = РегистрыСведений.ТекущиеЦены.СоздатьМенеджерЗаписи();

		Отбор.UID = СтруктураИнструмента.instrumentUid;
		СтрокиИнструмента = Инструменты.НайтиСтроки(Отбор);
		Если СтрокиИнструмента.Количество() = 1 Тогда
			Инструмент = СтрокиИнструмента[0].Ссылка;
		Иначе
			Сообщить("Не найден инструмент по uid " + СтруктураИнструмента.instrumentUid);
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи.Период = ПреобразоватьСтрокуВДату(Лев(СтруктураИнструмента.time, 19));
		МенеджерЗаписи.Инструмент = Инструмент;
		МенеджерЗаписи.Цена = ЦенаИзКотировки(СтруктураИнструмента.price);
		МенеджерЗаписи.lastPriceType = СтруктураИнструмента.lastPriceType;
		МенеджерЗаписи.Источник = Источник;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;

	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьСчетаПользователя() Экспорт

	Тело = Новый Структура;
	Тело.Вставить("status", "ACCOUNT_STATUS_UNSPECIFIED");
	ТелоJSON = ms_РаботаСREST.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ОтветСервиса = ms_РаботаСREST.TInvest_ВыполнитьЗапрос("POST", "UsersService", "GetAccounts", ПараметрыЗапроса);

	Если Не ОтветСервиса.Свойство("accounts") Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;

	accounts = ОтветСервиса.accounts;

	Для Каждого account Из accounts Цикл

		Счет = Справочники.Счета.НайтиПоРеквизиту("AccountId", account.id);
		Если ЗначениеЗаполнено(Счет) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по коду %2", Счет, account.id), Счет);
		Иначе
			Счет = Справочники.Счета.НайтиПоНаименованию(account.name, Истина);
			Если ЗначениеЗаполнено(Счет) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по наименованию %2", Счет, account.name), Счет);
			КонецЕсли;
		КонецЕсли;

		ЕстьИзменения = Ложь;
		Если ЗначениеЗаполнено(Счет) Тогда
			СчетОбъект = Счет.ПолучитьОбъект();
		Иначе
			СчетОбъект = Справочники.Счета.СоздатьЭлемент();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан новый счёт %1 (%2)", account.name, account.id), Счет,,, ЕстьИзменения);
		КонецЕсли;

		Если СчетОбъект.Наименование <> account.name Тогда
			СчетОбъект.Наименование = account.name;
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменено наименование счёта %1 с %2 на %3", Счет, СчетОбъект.Наименование, account.name), Счет,,, ЕстьИзменения);
		КонецЕсли;

		Если СчетОбъект.AccountId <> account.id Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменён код счёта %1 с %2 на %3", Счет, СчетОбъект.AccountId, account.id), Счет,,, ЕстьИзменения);
			СчетОбъект.AccountId = account.id;
		КонецЕсли;

		ДатаОткрытия = ПреобразоватьСтрокуВДату(Лев(account.openedDate, 19));
		Если СчетОбъект.ДатаОткрытия <> ДатаОткрытия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата открытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаОткрытия, ДатаОткрытия), Счет,,, ЕстьИзменения);
			СчетОбъект.ДатаОткрытия = ДатаОткрытия;
		КонецЕсли;

		ДатаЗакрытия = ПреобразоватьСтрокуВДату(Лев(account.closedDate, 19));
		Если СчетОбъект.ДатаЗакрытия <> ДатаЗакрытия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата закрытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаЗакрытия, ДатаЗакрытия), Счет,,, ЕстьИзменения);
			СчетОбъект.ДатаЗакрытия = ДатаЗакрытия;
		КонецЕсли;

		СчетОбъект.Активен = account.status = "ACCOUNT_STATUS_OPEN";

		СчетОбъект.Платформа = Справочники.Платформы.ТИнвестиции;
		СчетОбъект.ТипСчета = account.type;

		Если ЕстьИзменения Тогда
			СчетОбъект.Записать();
		КонецЕсли;

//accessLevel	"ACCOUNT_ACCESS_LEVEL_READ_ONLY"
//closedDate	"1970-01-01T00:00:00Z"
//id	"2022875146"
//name	"ИИС"
//openedDate	"2020-03-23T00:00:00Z"
//status	"ACCOUNT_STATUS_OPEN"
//type	"ACCOUNT_TYPE_TINKOFF_IIS"
	КонецЦикла;

КонецПроцедуры // ПолучитьСчетаПользователя

Процедура СписокПозицийПоСчету(AccountId) Экспорт

	Тело = Новый Структура;
	Тело.Вставить("AccountId", AccountId);
	ТелоJSON = ms_РаботаСREST.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ОтветСервиса = ms_РаботаСREST.TInvest_ВыполнитьЗапрос("POST", "OperationsService", "GetPositions ", ПараметрыЗапроса);


//money
//Массив валютных позиций портфеля.

//blocked
//Массив заблокированных валютных позиций портфеля.

//securities
//Список ценно-бумажных позиций портфеля.

//limitsLoadingInProgress
//Boolean
//Признак идущей выгрузки лимитов в данный момент.

//futures
//Список фьючерсов портфеля.

//options
//Список опционов портфеля.

//Если Не ОтветСервиса.Свойство("accounts") Тогда
//		Сообщить("Нет данных");
//		Возврат;
//	КонецЕсли;
//
//	accounts = ОтветСервиса.accounts;
//
//	Для Каждого account Из accounts Цикл
//
//		Счет = Справочники.Счета.НайтиПоРеквизиту("AccountId", account.id);
//		Если ЗначениеЗаполнено(Счет) Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по коду %2", Счет, account.id), Счет);
//		Иначе
//			Счет = Справочники.Счета.НайтиПоНаименованию(account.name, Истина);
//			Если ЗначениеЗаполнено(Счет) Тогда
//				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по наименованию %2", Счет, account.name), Счет);
//			КонецЕсли;
//		КонецЕсли;
//
//		ЕстьИзменения = Ложь;
//		Если ЗначениеЗаполнено(Счет) Тогда
//			СчетОбъект = Счет.ПолучитьОбъект();
//		Иначе
//			СчетОбъект = Справочники.Счета.СоздатьЭлемент();
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан новый счёт %1 (%2)", account.name, account.id), Счет,,, ЕстьИзменения);
//		КонецЕсли;
//
//		Если СчетОбъект.Наименование <> account.name Тогда
//			СчетОбъект.Наименование = account.name;
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменено наименование счёта %1 с %2 на %3", Счет, СчетОбъект.Наименование, account.name), Счет,,, ЕстьИзменения);
//		КонецЕсли;
//
//		Если СчетОбъект.AccountId <> account.id Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменён код счёта %1 с %2 на %3", Счет, СчетОбъект.AccountId, account.id), Счет,,, ЕстьИзменения);
//			СчетОбъект.AccountId = account.id;
//		КонецЕсли;
//
//		ДатаОткрытия = ПреобразоватьСтрокуВДату(Лев(account.openedDate, 19));
//		Если СчетОбъект.ДатаОткрытия <> ДатаОткрытия Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата открытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаОткрытия, ДатаОткрытия), Счет,,, ЕстьИзменения);
//			СчетОбъект.ДатаОткрытия = ДатаОткрытия;
//		КонецЕсли;
//
//		ДатаЗакрытия = ПреобразоватьСтрокуВДату(Лев(account.closedDate, 19));
//		Если СчетОбъект.ДатаЗакрытия <> ДатаЗакрытия Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата закрытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаЗакрытия, ДатаЗакрытия), Счет,,, ЕстьИзменения);
//			СчетОбъект.ДатаЗакрытия = ДатаЗакрытия;
//		КонецЕсли;
//
//		СчетОбъект.Активен = account.status = "ACCOUNT_STATUS_OPEN";
//
//		СчетОбъект.Платформа = Справочники.Платформы.ТИнвестиции;
//		СчетОбъект.ТипСчета = account.type;
//
//		Если ЕстьИзменения Тогда
//			СчетОбъект.Записать();
//		КонецЕсли;
//
////accessLevel	"ACCOUNT_ACCESS_LEVEL_READ_ONLY"
////closedDate	"1970-01-01T00:00:00Z"
////id	"2022875146"
////name	"ИИС"
////openedDate	"2020-03-23T00:00:00Z"
////status	"ACCOUNT_STATUS_OPEN"
////type	"ACCOUNT_TYPE_TINKOFF_IIS"
//	КонецЦикла;

КонецПроцедуры // СписокПозицийПоСчету

Процедура ПортфельПоСчету(Счет, currency = Неопределено, ПрочитатьГотовыеДанные = Ложь) Экспорт

	Если ТипЗнч(Счет) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		AccountId = Счет.AccountId;
		СчетСсылка = Счет.Ссылка;
	ИначеЕсли ТипЗнч(Счет) = Тип("Строка") Тогда
		AccountId = Счет;
		СчетСсылка = Справочники.Счета.НайтиПоРеквизиту("AccountId", AccountId);
	Иначе
		ВызватьИсключение "неизвестный тип данных в процедуре ПортфельПоСчету - " + ТипЗнч(Счет);
	КонецЕсли;
	Тело = Новый Структура;
	Тело.Вставить("accountId", AccountId);
	Тело.Вставить("currency", "RUB");
	ТелоJSON = ms_РаботаСREST.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ДанныеСервиса = ms_РаботаСREST.TInvest_ВыполнитьЗапрос("POST", "OperationsService", "GetPortfolio", ПараметрыЗапроса);


//totalAmountShares Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountBonds Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountEtf Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountCurrencies Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountFutures Object (v1MoneyValue) Денежная сумма в определенной валюте.
//expectedYield Object (v1Quotation) Котировка — денежная сумма без указания валюты.
//positions Array of objects () Список позиций портфеля.
//accountId String Идентификатор счета пользователя.
//totalAmountOptions Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountSp Object (v1MoneyValue) Денежная сумма в определенной валюте.
//totalAmountPortfolio Object (v1MoneyValue) Денежная сумма в определенной валюте.
//virtualPositions Array of objects () Массив виртуальных позиций портфеля.
//dailyYield  Object (v1MoneyValue) Денежная сумма в определенной валюте.
//dailyYieldRelative Object (v1Quotation) Котировка — денежная сумма без указания валюты.

	Если ПрочитатьГотовыеДанные Тогда
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.НайтиПоКоду("000000001");
		ДанныеСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВременноеХранениеДанных, "ХранилищеЗначения").Получить();
	Иначе
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.СоздатьЭлемент();
		ВременноеХранениеДанных.ХранилищеЗначения = Новый ХранилищеЗначения(ДанныеСервиса, Новый СжатиеДанных(9));
		ВременноеХранениеДанных.Записать();
		ОбщегоНазначения.СообщитьПользователю("Записаны данные " + ВременноеХранениеДанных, ВременноеХранениеДанных);
		//Записаны данные 000000001
	КонецЕсли;

	Если Не ДанныеСервиса.Свойство("positions") Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;

	positions = ДанныеСервиса.positions;

	Источник = Справочники.ИсточникиДанных.ТИнвест;
	КоличествоЗаписей = 0;
	Для Каждого position Из positions Цикл

		МенеджерЗаписи = РегистрыСведений.ИмпортДанныхБрокера.СоздатьМенеджерЗаписи();

		//Отбор.UID = СтруктураИнструмента.instrumentUid;
		//СтрокиИнструмента = Инструменты.НайтиСтроки(Отбор);
		//Если СтрокиИнструмента.Количество() = 1 Тогда
		//	Инструмент = СтрокиИнструмента[0].Ссылка;
		//Иначе
		//	Сообщить("Не найден инструмент по uid " + СтруктураИнструмента.instrumentUid);
		//	Продолжить;
		//КонецЕсли;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(position.instrumentUid);
		МенеджерЗаписи.instrumentUid = position.instrumentUid;
		МенеджерЗаписи.averagePositionPrice = ЦенаИзКотировки(position.averagePositionPrice);
		МенеджерЗаписи.currency = position.averagePositionPrice.currency;
		МенеджерЗаписи.averagePositionPricePt = ЦенаИзКотировки(position.averagePositionPricePt);
		МенеджерЗаписи.currency1 = position.averagePositionPrice.currency;
		МенеджерЗаписи.expectedYield = ЦенаИзКотировки(position.expectedYield);
		МенеджерЗаписи.quantityLots = ЦенаИзКотировки(position.quantityLots);
		МенеджерЗаписи.ticker = position.ticker;
		МенеджерЗаписи.Источник = Источник;
		МенеджерЗаписи.Счет = СчетСсылка;
		//МенеджерЗаписи.AccountId = AccountId;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;

	КонецЦикла;

	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Загружены данные по счету %1, количество позиций: %2", СчетСсылка, КоличествоЗаписей));

КонецПроцедуры // ПортфельПоСчету

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьЗапросRESTAPI(Метод, Команда, ПараметрыЗапроса) Экспорт

	ИмяХоста = "translation.googleapis.com";

	УстановитьПривилегированныйРежим(Истина);
	HTTPЗапрос = Новый HTTPЗапрос("/language/translate/v2?key=" + НастройкиАвторизации().КлючAPI);
	УстановитьПривилегированныйРежим(Ложь);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("format", "text");
//	ПараметрыЗапроса.Вставить("q", Тексты);
	//ПараметрыЗапроса.Вставить("target", ЯзыкПеревода);

	//Если ЗначениеЗаполнено(ИсходныйЯзык) Тогда
	//	ПараметрыЗапроса.Вставить("source", ИсходныйЯзык);
	//КонецЕсли;

	HTTPЗапрос.УстановитьТелоИзСтроки(ОбщегоНазначения.ЗначениеВJSON(ПараметрыЗапроса));
	РезультатЗапроса = ВыполнитьЗапрос(HTTPЗапрос, ИмяХоста);

	Если Не РезультатЗапроса.ЗапросВыполнен Тогда
		ВызватьИсключение ТекстОшибки(НСтр("ru = 'Не удалось получить данные из Т-Инвест'"));
	КонецЕсли;

	ОтветСервера = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ОтветСервера);

КонецФункции // ВыполнитьЗапросRESTAPI()

Функция ВыполнитьЗапрос(Знач HTTPЗапрос, Знач ИмяХоста)

	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();

	Попытка
		ДоступРазрешен = ОбщегоНазначения.РазрешенДоступКИнтернетСервисам(Истина);
		Соединение = Новый HTTPСоединение(ИмяХоста, , , , Прокси, 60, ЗащищенноеСоединение);
		HTTPОтвет = "";//пока заглушка Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЗаписатьОшибкуВЖурналРегистрации(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить соединение с сервером %1 по причине:
			|%2'"), ИмяХоста, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		ВызватьИсключение;
	КонецПопытки;

	Результат = Новый Структура;
	Результат.Вставить("ЗапросВыполнен", Ложь);
	Результат.Вставить("ОтветСервера", "");

	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"),
			HTTPЗапрос.АдресРесурса,
			HTTPОтвет.КодСостояния) + Символы.ПС + HTTPОтвет.ПолучитьТелоКакСтроку();
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
	КонецЕсли;

	Если HTTPОтвет.КодСостояния = 401
		Или HTTPОтвет.КодСостояния = 403 Тогда
		ИнформацияОбОшибке = ОбщегоНазначения.JSONВЗначение(HTTPОтвет.ПолучитьТелоКакСтроку());
		ВызватьИсключение ИнформацияОбОшибке["error"]["message"];
	КонецЕсли;

	Результат.ЗапросВыполнен = HTTPОтвет.КодСостояния = 200;
	Результат.ОтветСервера = HTTPОтвет.ПолучитьТелоКакСтроку();

	Возврат Результат;

КонецФункции

Функция НастройкиАвторизации(ИдентификаторОбъектаМетаданных = Неопределено) Экспорт

	ИменаПараметров = "КлючAPI";
	Результат = Новый Структура(ИменаПараметров);

	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИдентификаторОбъектаМетаданных);
		Настройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, ИменаПараметров);

		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Результат, Настройки);
		ИначеЕсли ТипЗнч(Настройки) = Тип("Строка") Тогда
			Результат.КлючAPI = Настройки;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Комментарий)

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Перевод текста'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , Перечисления.СервисыПереводаТекста.GoogleПереводчик, Комментарий);

КонецПроцедуры

Функция ТекстОшибки(ТекстОшибки)

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Подробности см. в журнале регистрации.'");
	КонецЕсли;

	Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Обратитесь к администратору.'");

КонецФункции

Процедура ТестHTTP() Экспорт
	


//Функция TInvest_НайтиИнструмент_(Токен, СтрокаПоиска, ТипИнструмента = "INSTRUMENT_TYPE_UNSPECIFIED", ТолькоТоргуемые = Истина, Песочница = Ложь) Экспорт
//
//	Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
//		Возврат Неопределено;
//	КонецЕсли;

//	// Host для REST-прокси
//	Хост = ?(Песочница, "sandbox-invest-public-api.tbank.ru", "invest-public-api.tbank.ru");
//	Порт = 443;

//	// Путь метода (REST proxy)
//	Путь = "/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/FindInstrument";

//	// Тело запроса
//	Тело = Новый Структура;
//	Тело.Вставить("query", СтрокаПоиска);
//	Тело.Вставить("instrumentKind", ТипИнструмента);
//	Тело.Вставить("apiTradeAvailableFlag", ТолькоТоргуемые);

//	ТелоJSON = TInvest_СериализоватьВJSON(Тело);

//	// HTTPS соединение
//	// В большинстве окружений хватит простого HTTPСоединение по 443.
//	Таймаут = 1;
//
//	Соединение = Новый HTTPСоединение(Хост, Порт,,,, Таймаут, Истина);

//	Запрос = Новый HTTPЗапрос(Путь);
//	Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

//	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
//	Запрос.Заголовки.Вставить("Content-Type", "application/json");
//	Запрос.Заголовки.Вставить("Accept", "application/json");

//	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);

//	Если Ответ.КодСостояния <> 200 Тогда
//		// Для отладки удобно вернуть текст ошибки
//		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
//		ВызватьИсключение СтрШаблон("T-Invest FindInstrument: HTTP %1. %2", Ответ.КодСостояния, ТекстОшибки);
//	КонецЕсли;

//	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
//	Данные = TInvest_ПрочитатьJSON(ТекстОтвета);

//	// Обычно в ответе массив инструментов. Конкретное имя поля зависит от схемы ответа в Swagger.
//	// Поэтому возвращаем весь разобранный объект, а дальше ты уже выберешь нужное (figi/uid/ticker).
//	Возврат Данные;

//КонецФункции

//Функция TInvest_ОсновнаяИнформацияОбИнструменте_(Токен, СтрокаПоиска, КлассКод = "INSTRUMENT_TYPE_UNSPECIFIED", ТолькоТоргуемые = Истина, Песочница = Ложь) Экспорт
//
//	Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
//		Возврат Неопределено;
//	КонецЕсли;

//	// Host для REST-прокси
//	Хост = ?(Песочница, "sandbox-invest-public-api.tbank.ru", "invest-public-api.tbank.ru");
//	Порт = 443;

//	// Путь метода (REST proxy)
//	Путь = "/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/GetInstrumentBy";

//	// Тело запроса
//	Тело = Новый Структура;
//	Тело.Вставить("id_type", "INSTRUMENT_ID_TYPE_TICKER");
//	Тело.Вставить("class_code", КлассКод);
//	Тело.Вставить("id", СтрокаПоиска);

//	ТелоJSON = TInvest_СериализоватьВJSON(Тело);

//	// HTTPS соединение
//	// В большинстве окружений хватит простого HTTPСоединение по 443.
//	Таймаут = 1;
//
//	Соединение = Новый HTTPСоединение(Хост, Порт,,,, Таймаут, Истина);

//	Запрос = Новый HTTPЗапрос(Путь);
//	Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

//	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
//	Запрос.Заголовки.Вставить("Content-Type", "application/json");
//	Запрос.Заголовки.Вставить("Accept", "application/json");

//	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);

//	Если Ответ.КодСостояния <> 200 Тогда
//		// Для отладки удобно вернуть текст ошибки
//		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
//		ВызватьИсключение СтрШаблон("T-Invest GetInstrumentBy : HTTP %1. %2", Ответ.КодСостояния, ТекстОшибки);
//	КонецЕсли;

//	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
//	Данные = TInvest_ПрочитатьJSON(ТекстОтвета);

//	// Обычно в ответе массив инструментов. Конкретное имя поля зависит от схемы ответа в Swagger.
//	// Поэтому возвращаем весь разобранный объект, а дальше ты уже выберешь нужное (figi/uid/ticker).
//	Возврат Данные;

//КонецФункции

Функция TInvest_ВыполнитьЗапрос(Метод = "POST", РазделAPI, ИмяКоманды, ПараметрыЗапроса, Песочница = Ложь) Экспорт

	//СтрокаПоиска ="?"; КлассКод = "INSTRUMENT_TYPE_UNSPECIFIED";
	//// ТолькоТоргуемые = Истина,
	//
	//Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;

	РеквизитыИсточникаДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.ИсточникиДанных.ТИнвест, "Адрес, Путь, Порт");

	Если ПараметрыЗапроса.Свойство("Токен") И ЗначениеЗаполнено(ПараметрыЗапроса.Токен) Тогда
		Токен = ПараметрыЗапроса.Токен;
	Иначе
		Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ИсточникиДанных");
		ИмяСервиса = Справочники.ИсточникиДанных.ТИнвест.Наименование;
		Токен = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, ИмяСервиса);
	КонецЕсли;

	// Host для REST-прокси
	Хост = ?(Песочница, "sandbox-invest-public-api.tbank.ru", РеквизитыИсточникаДанных.Адрес);
	Порт = РеквизитыИсточникаДанных.Порт;

	// Путь метода (REST proxy)
	Путь = РеквизитыИсточникаДанных.Путь + "." + РазделAPI + "/" + ИмяКоманды;

	//// Тело запроса
	//Тело = Новый Структура;
	//ЗаполнитьЗначенияСвойств(ПараметрыЗапроса.Тело, ПараметрыЗапроса);
	////Тело.Вставить("id_type", "INSTRUMENT_ID_TYPE_TICKER");
	////Тело.Вставить("class_code", КлассКод);
	////Тело.Вставить("id", СтрокаПоиска);

	//ТелоJSON = TInvest_СериализоватьВJSON(Тело);
	Тело = Неопределено;
	Если ПараметрыЗапроса.Свойство("Тело", Тело) Тогда
		Если ТипЗнч(Тело) = Тип("Строка") Тогда
			ТелоJSON = Тело;
		ИначеЕсли ТипЗнч(Тело) = Тип("Структура") Или ТипЗнч(Тело) = Тип("Массив") Тогда
			ТелоJSON = TInvest_СериализоватьВJSON(Тело);
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не тот тип параметра запроса 'Тело': " + ТипЗнч(Тело));
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не передан параметр запроса 'Тело'");
		Возврат Неопределено;
	КонецЕсли;
//ТелоJSON = ПараметрыЗапроса.Тело;

	// HTTPS соединение
	// В большинстве окружений хватит простого HTTPСоединение по 443.
	Таймаут = 1;


		НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
		НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");

	//Соединение = Новый HTTPСоединение(Хост, Порт,,,, Таймаут, Истина);

	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

Соединение = Новый HTTPСоединение("invest-public-api.tbank.ru", 443,,, НастройкиПрокси, 1, Истина);

//Путь2 = "/rest/tinkoff.public.invest.api.contract.v1.MarketDataService/GetLastPrices";
//Если Путь <> Путь2 Тогда
//	Сообщить("Путь!");
//КонецЕсли;
//Запрос = Новый HTTPЗапрос(Путь2);

//	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
//	Запрос.Заголовки.Вставить("Content-Type", "application/json");
//	Запрос.Заголовки.Вставить("Accept", "application/json");

//ТелоJSON = "{""instrumentId"":[""f8f1de0d-5a5f-47e9-8ecb-00bec8f8351f""]}";
//Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

//Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
//Сообщить(Ответ.КодСостояния);
//Сообщить(Ответ.ПолучитьТелоКакСтроку());
//	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
//	Данные = TInvest_ПрочитатьJSON(ТекстОтвета);
//Возврат Данные;

	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");

	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		// Для отладки удобно вернуть текст ошибки
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
		ВызватьИсключение СтрШаблон("Сервис T-Invest при обращении к методу %3 сообщил об ошибке: %1.
						|%2
						|Тело: %4", Ответ.КодСостояния, ТекстОшибки, ИмяКоманды, ТелоJSON);
	КонецЕсли;

	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Данные = TInvest_ПрочитатьJSON(ТекстОтвета);

	// Обычно в ответе массив инструментов. Конкретное имя поля зависит от схемы ответа в Swagger.
	// Поэтому возвращаем весь разобранный объект, а дальше ты уже выберешь нужное (figi/uid/ticker).
	Возврат Данные;

КонецФункции

Функция TInvest_СериализоватьВJSON(Значение) Экспорт

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение);
	Возврат Запись.Закрыть();

КонецФункции

Функция TInvest_ПрочитатьJSON(СтрокаJSON) Экспорт

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(Чтение);

КонецФункции

Функция ЦенаИзКотировки(Котировка) Экспорт

	Если Котировка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	// units приходит строкой
	ЦелаяЧасть = Число(Котировка.units);
	ДробнаяЧасть = Котировка.nano / 1000000000;

	Возврат ЦелаяЧасть + ДробнаяЧасть;

КонецФункции

Функция ПреобразоватьСтрокуВДату(Значение)

	Если Значение = "1970-01-01T00:00:00" ИЛИ Значение = "1970-01-01T00:00:00Z" Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	Дата = XMLЗначение(Тип("Дата"), Значение);
	Если Год(Дата) = 1970 И Месяц(Дата) = 1 И День(Дата) = 1 Тогда
		Дата = Дата(1, 1, 1);
	КонецЕсли;
	Возврат Дата;

КонецФункции // ПреобразоватьСтрокуВДату()


#КонецОбласти



//Также у нас есть метод поиска инструмента по различным параметрам — FindInstrument. Он выполняет регистронезависимый поиск по вхождению строки query согласно приоритету:

//    position_uid;
//    uid;
//    figi;
//    isin;
//    ticker;
//    name.


//Идентификация торговых инструментов

//Для точного определения торговых инструментов используются разные идентификаторы:

//    Isin (International Security Identification Number) — международный идентификационный номер ценной бумаги. Состоит из 12 символов цифр и латинских букв, которые обычно начинаются с 2-буквенного кода страны эмитента ценной бумаги.

//    Структура ISIN
//    Первые два символа — буквы, определяющие код страны эмитента согласно стандарту ISO 3166-1 — например, российские ISIN-коды начинаются буквами RU.
//    Далее — 9 букв и цифр национального идентификационного кода ценной бумаги (National Securities Identifying Number, NSIN). Завершает код контрольная цифра. Например, ISIN акции TCS Group — US87238U2033.

//    Ticker — краткое (1–5 букв) наименование ценной бумаги на конкретной бирже. Без указания биржи и режима торгов это просто набор букв — поэтому на российских биржах MOEX и SPBE используется специальный признак «Режим торгов», который соответствует техническому термину class_code. Комбинация тикера и class_code является уникальным идентификатором, только тикер — нет.
//    Например, тикер Т-Технологий — T.

//    FIGI (Financial Instrument Global Identifier) — глобальный идентификатор финансового инструмента. Представляет собой 12-символьный код из латинских букв и цифр. Определяется как идентификатор ценной бумаги на торговой площадке (бирже), которая является некоторым «источником цен».

//    Обратите внимание: FIGI, присваемые в Т-Инвестициях, не всегда совпадают с международным классификатором. Это устаревший параметр, который не рекомендуется использовать. Используйте uid — уникальный идентификатор в формате uuid.

//Идентификаторы из модели финансовых инструментов Т-Инвестиций

//В Т-Инвестициях применяется иерархическая система идентификации финансовых объектов.

//Бренд

//На верхнем уровне находится бренд — работающая на финансовом рынке компания, которая является эмитентом ценных бумаг. Пример бренда — Сбербанк.

//Актив

//У бренда может несколько финансовых инструментов: акции, в том числе на разных биржах, облигации и прочее. Каждая из ценных бумаг называется актив.

//Позиция

//Один и тот же актив может торговаться на разных биржах. Совокупность актива и торговой площадки (биржи) — это позиция.

//В некоторых ситуациях размещение бумаг на бирже, выплаты купонов и дивидендов проходят позициям, которые отличаются от тех, что торгуются на бирже или находятся в портфеле.

//Торговый инструмент

//Одна и та же позиция может торговаться в разных режимах торгов и по разной цене. Например, валюта разной лотности может иметь различную стоимость, а акцию можно продать на биржевом и внебиржевом рынках, то есть в торговле на выходных.

//Поэтому есть еще один идентификатор — торговый инструмент. Он определяется как ценная бумага на торговой площадке (бирже) в указанном режиме торгов. Получить котировки можно только по торговому инструменту.
//Параметры в API

//    uid бренда — идентификатор компании;
//    asset_uid — идентификатор актива;
//    position_uid — идентификатор позиции;
//    instrument_uid — идентификатор торгового инструмента;
//    ticker — тикер;
//    class_code — класс-код (секция торгов).

//Instrument_Id

//Для удобства клиентов, которые в своих системах использовали устаревший идентификатор FIGI, в большинстве методов T-Invest API предусмотрено универсальное поле Instrument_Id — в нем можно передавать как FIGI, так и instrument_uid.

//Вы можете получить идентификаторы конкретного инструмента через метод FindInstrument, передав в параметре query известный идентификатор или название инструмента.

//Основной идентификатор торгового инструмента при работе с T-Invest API — UID, так как, например, в опционах идентификатор FIGI не поддерживается.
//Ticker и Class_Code

//Для удобства взаимодействия во входной параметр instrument_id методов API можно передать ticker и class_code инструмента в формате ticker + '_' + class_code. Пример использования комбинации тикера и класс-кода для акций "Т-Технологии" на московской бирже:

//`instrument_id = 'T_TQBR'`

//Как получить тикер и класс-код

//Чтобы узнать значения параметров, получите детали методами сервиса инструментов. Тикер и класс-код также присутствует в ответах всех методов сервисов, где ожидается получить идентификаторы инструмента.
